https://Daniellem97.app.spacelift.io/stack/newstateimporttest/run/01JWM7SJ5TTTPWWRQC8KNH4TZ7 has finished

## Planning logs

```
[01JWGYE3KGQS7VH6S4T5DHN2DM] Planning changes with 0 custom hooks...
data.terraform_remote_state.demo-stack-state: Reading...
data.terraform_remote_state.demo-stack-state: Read complete after 0s
module.kms.data.aws_caller_identity.current[0]: Reading...
module.kms.data.aws_partition.current[0]: Reading...
aws_vpc.mtc_vpc: Refreshing state... [id=vpc-01ac7a7b920206ed1]
module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=872025319814]
module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4087627824]
aws_route_table.mtc_public_rt: Refreshing state... [id=rtb-0d1de55c7767e49e2]
aws_security_group.mtc_sg: Refreshing state... [id=sg-0eeb02cbbc769a39f]
aws_internet_gateway.mtc_internet_gateway: Refreshing state... [id=igw-0118f0a49606fdd4d]
aws_subnet.mtc_public_subnet: Refreshing state... [id=subnet-04b0ee0500216e8bb]
aws_route.default_route: Refreshing state... [id=r-rtb-0d1de55c7767e49e21080289494]
aws_route.default_route2: Refreshing state... [id=r-rtb-0d1de55c7767e49e21080289494]
aws_route_table_association.mtc_public_assoc: Refreshing state... [id=rtbassoc-0fa1c4c7953dbc594]

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # aws_internet_gateway.mtc_internet_gateway has been deleted
  - resource "aws_internet_gateway" "mtc_internet_gateway" {
      - id       = "igw-0118f0a49606fdd4d" -> null
        tags     = {
            "Name" = "mtc_igw2"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_route_table.mtc_public_rt has been deleted
  - resource "aws_route_table" "mtc_public_rt" {
      - id               = "rtb-0d1de55c7767e49e2" -> null
        tags             = {
            "Name" = "dev_public_rt"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_subnet.mtc_public_subnet has been deleted
  - resource "aws_subnet" "mtc_public_subnet" {
      - id                                             = "subnet-04b0ee0500216e8bb" -> null
        tags                                           = {
            "Repository" = "new2"
        }
        # (15 unchanged attributes hidden)
    }

  # aws_vpc.mtc_vpc has been deleted
  - resource "aws_vpc" "mtc_vpc" {
      - id                               = "vpc-01ac7a7b920206ed1" -> null
        tags                             = {
            "Name" = "dev22"
        }
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_internet_gateway.mtc_internet_gateway will be created
  + resource "aws_internet_gateway" "mtc_internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "mtc_igw2"
        }
      + tags_all = {
          + "Name" = "mtc_igw2"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route.default_route will be created
  + resource "aws_route" "default_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.default_route2 will be created
  + resource "aws_route" "default_route2" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.mtc_public_rt will be created
  + resource "aws_route_table" "mtc_public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dev_public_rt"
        }
      + tags_all         = {
          + "Name" = "dev_public_rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.mtc_public_assoc will be created
  + resource "aws_route_table_association" "mtc_public_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.mtc_sg will be created
  + resource "aws_security_group" "mtc_sg" {
      + arn                    = (known after apply)
      + description            = "public security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "public_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.mtc_public_subnet will be created
  + resource "aws_subnet" "mtc_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.123.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Repository" = "new2"
        }
      + tags_all                                       = {
          + "Repository" = "new2"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.mtc_vpc will be created
  + resource "aws_vpc" "mtc_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.123.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "dev23"
        }
      + tags_all                             = {
          + "Name" = "dev23"
        }
    }

  # module.kms.aws_kms_grant.this["lambda"] will be created
  + resource "aws_kms_grant" "this" {
      + grant_id          = (known after apply)
      + grant_token       = (known after apply)
      + grantee_principal = "arn:aws:iam::012345678901:role/lambda-function"
      + id                = (known after apply)
      + key_id            = (known after apply)
      + name              = "lambda"
      + operations        = [
          + "Decrypt",
          + "Encrypt",
          + "GenerateDataKey",
        ]
      + retire_on_delete  = false

      + constraints {
          + encryption_context_equals = {
              + "Department" = "Finance"
            }
        }
    }

  # module.kms.aws_kms_key.this[0] will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "Complete key example showing various configurations available"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::872025319814:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Default"
                    },
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/owner"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyOwner"
                    },
                  + {
                      + Action    = [
                          + "kms:Update*",
                          + "kms:UntagResource",
                          + "kms:TagResource",
                          + "kms:ScheduleKeyDeletion",
                          + "kms:Revoke*",
                          + "kms:ReplicateKey",
                          + "kms:Put*",
                          + "kms:List*",
                          + "kms:ImportKeyMaterial",
                          + "kms:Get*",
                          + "kms:Enable*",
                          + "kms:Disable*",
                          + "kms:Describe*",
                          + "kms:Delete*",
                          + "kms:Create*",
                          + "kms:CancelKeyDeletion",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/admin"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyAdministration"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/user"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyUsage"
                    },
                  + {
                      + Action    = [
                          + "kms:RevokeGrant",
                          + "kms:ListGrants",
                          + "kms:CreateGrant",
                        ]
                      + Condition = {
                          + Bool = {
                              + "kms:GrantIsForAWSResource" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/ec2-role"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyServiceUsage"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/symmetric-user"
                        }
                      + Resource  = "*"
                      + Sid       = "KeySymmetricEncryption"
                    },
                  + {
                      + Action    = [
                          + "kms:VerifyMac",
                          + "kms:GenerateMac",
                          + "kms:DescribeKey",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/hmac-user"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyHMAC"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GetPublicKey",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/asymmetric-public-user"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyAsymmetricPublicEncryption"
                    },
                  + {
                      + Action    = [
                          + "kms:Verify",
                          + "kms:Sign",
                          + "kms:GetPublicKey",
                          + "kms:DescribeKey",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/sign-verify-user"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyAsymmetricSignVerify"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - dev_ip1       = "test131" -> null
  + dev_ip4       = "test132"
  - randomoutput2 = "dummy" -> null
[01JWGYE3KGQS7VH6S4T5DHN2DM] Changes are GO
Failed to marshal state to json: unsupported attribute "instance_id"
[01JWGYE3KGQS7VH6S4T5DHN2DM] unexpected exit code when running show command: 1
[01JWGYE3KGQS7VH6S4T5DHN2DM] Uploading the list of managed resources...
[01JWGYE3KGQS7VH6S4T5DHN2DM] Please be aware that the run changes calculation includes output changes.
[01JWGYE3KGQS7VH6S4T5DHN2DM] Resource list upload is GO
[01JWGYE3KGQS7VH6S4T5DHN2DM] Generating JSON representation of the plan...
[01JWGYE3KGQS7VH6S4T5DHN2DM] JSON representation is GO
[01JWGYE3KGQS7VH6S4T5DHN2DM] Loading custom plan policy inputs...
[01JWGYE3KGQS7VH6S4T5DHN2DM] 0 custom plan policy inputs found
[01JWGYE3KGQS7VH6S4T5DHN2DM] No plan policies to evaluate
```
